## Python for Data Analysis (Numpy and Pandas)

First, let's make a database with students' school record. 

| name  | student id  |grade1| grade2| grade3  |
| --- | --- | --- |--- | --- |
| David |  915  |    85      |       34      |        98        |
| John  |  927   |   75       |      80      |        79        |
| Mark  |  876   |   88       |      89      |        90        |


This is also provided in csv files. One of them has the header "name, student id, ..." and the other one doesn't.

# Pandas

In [14]:
import pandas as pd
import numpy as np

In [42]:
# Define our data and put it into a pandas dataframe
# To that end, dictionary can be used

data = {'name': ['Alice','bob','Chris'], 'sid':[ 915, 927, 876], 'grade1':[85, 75, 88], 'grade2':[34, 80, 89], 'grade3':[98, 79, 90]}

# another way to define it is 
# adding one attritube at a time
data2 = dict()
data2['name'] = ['Alice','bob','Chris']
data2['sid'] = [ 915, 927, 876]
data2['grade1'] = [85, 75, 88]
data2['grade2'] = [34, 80, 89]
data2['grade3'] = [98, 79, 90]

data == data2

True

In [45]:
# dictionary is used to associate a key value and a corresponding attribute
# for example, data[key ], where key = 'name', 'sid', 'grade1',...
print('Names are {}\ncourse 1 grades are {} '.format(data['name'],data['grade1']))

Names are ['Alice', 'bob', 'Chris']
course 1 grades are [85, 75, 88]

In [28]:
# can we get some statistics out of them?
print('%.4f %.4f \n'%(np.mean(data['grade1']), np.std(data['grade1'])))
print('{0:.4f} {1:.4f}'.format(np.mean(data['grade2']), np.std(data['grade2']) ) )

82.6667 5.5578

67.6667 24.0878

In [7]:
df = pd.DataFrame(data)

    name  sid  grade1  grade2  grade3
0  Alice  915      85      34      98
1    bob  927      75      80      79
2  Chris  876      88      89      90

In [10]:
# let's import data from csv, comma separated value format.
df = pd.read_csv('grade.csv')

In [11]:
df

    name   sid   grade1   grade2   grade3
0  Alice   915       85       34        98
1    Bob   927       75       80        79
2  Chris   876       88       89        90

In [29]:
df = pd.read_csv('grade_wo_header.csv')

In [32]:
# we are in trouble. Let's check
df

   Alice     915        85               34                98
0    Bob     927        75               80                79
1  Chris     876        88               89                90

In [35]:
# since the file does not have header names, let's give them while reading
df = pd.read_csv('grade_wo_header.csv', names = ['name', 'sid', 'grade1', 'grade2', 'grade3'])

In [37]:
# now, it is what it should be
df

    name  sid  grade1  grade2  grade3
0  Alice  915      85      34      98
1    Bob  927      75      80      79
2  Chris  876      88      89      90